#define _CRT_SECURE_NO_WARNINGS             
                                             //操作符类型：1.算术操作符                               2.移位操作符
//#include<stdio.h>               //                     3.位操作符                                  4.赋值操作符
//                                            //                      5.单目操作符                               6.关系操作符
//int main()                            //                      7.逻辑操作符                                8.条件操作符
//{                                          //                      9.逗号操作符                                10.下标引用、函数调用和结构成员
//	int a = 4;
//	int b = 17;
//	int c = 0;
//	c = a + b;                          //  +
//	printf("%d\n", c);
//	c = a - b;                          //  -
//	printf("%d\n", c);
//	c = a * b;                         //  *
//	printf("%d\n", c);
//	c = b / a;                        //  /  除法运算，求的是商的值
//	printf("%d\n", c);
//	c = b % a;                      //  %   取模运算，求的是余数
//	printf("%d\n", c);
//	a = 4;
//	float d = 15.0; 
//	float e;
//	e = d / a;
//	printf("%f\n", e);         //默认情况下打印的是六位小数，小数用"f",确定小数位".xf"
//	printf("%.1f\n", e);      //3.8
//	printf("%.2f\n", e);      //3.75
//	// c = d% a;       浮点型不能取模运算
//	// printf("%d\n", c);
//	return 0;
//}

//复合赋值符
//+=
//-=
//*=
///=
//%=
//>>=
//<<=
//&=
//|=
//^=